Repository: pwsafe/pwsafe
Catalog: Misc/I18N/ru/omegat_help/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: If you don't want to use the default password policy (see Setting a Password Policy), you can define in this tab a different password policy, marking "Use the policy below" and setting the appropriate elements.
ru_ru: Если для выбранного элемента вы не желаете использовать «политику по умолчанию» (см. Настройка политики создания паролей), нужно выбрать на данной вкладке значение «Переопределить политику» и указать необходимые параметры в соответствующих полях.

source: If you don't want to use the default password policy (see Setting a Password Policy), you can define in this tab a different password policy, marking "Use the policy below" and setting the apropriate elements.
ru_ru: Если для выбранного элемента вы не желаете использовать «политику по умолчанию» (см. Настройка политики создания паролей), нужно выбрать на данной вкладке значение «Переопределить политику» и указать необходимые параметры в соответствующих полях.

source: If you find that AutoType does not work properly on a particular web site, try this code in the AutoType command field.
ru_ru: Если вы заметили, что автонабор работает некорректно на каком-то из сайтов, попробуйте добавить данную ключевую последовательность в автонабор для этого элемента.

source: If you find that Autotype does not work properly on a particular web site, try this code in the autotype command field.
ru_ru: Если вы заметили, что автонабор работает некорректно на каком-то из сайтов, попробуйте добавить данную ключевую последовательность в автонабор для этого элемента.

source: If you have a password associated with this database as well, enter it in the Old Safe Combination field
ru_ru: Если для доступа к контейнеру также используется пароль, введите его в поле «Старый пароль».

source: If you have installed all the currently available additional language DLLs when Password Safe was installed (which is the default), you will have the ability to switch between these languages on-the-fly via this menu item.
ru_ru: Если у вас установлены дополнительные языковые модули (устанавливаются по умолчанию), с помощью этого меню можно переключать язык программы на лету.

source: If you have undone a change, you can Redo it as long as you have not made another change in between.
ru_ru: Если какое-либо действие было отменено, вы можете вернуть его, нажав кнопку «Повторить» (если после него не было совершено других действий).

source: If you haven't already done so, insert your YubiKey into a USB slot on your PC.
ru_ru: Подключите YubiKey к USB-порту ПК, если это ещё не сделано.

source: If you regularly keep several databases open, you may set a unique temporary ID (a number between 1 and 99) that will be superimposed on top of the System Tray icon.
ru_ru: При одновременном использовании нескольких контейнеров можно задать для них временные уникальные идентификаторы (числа от 0 до 99), которые будут отображены поверх значка в области уведомлений.

source: If you repeat one of these operations and again save the report to disk, it will overwrite any previous report for this operation without requesting permission.
ru_ru: При повторении операции и сохранении отчёта на диск, предыдущий отчёт для этой операции перезаписывается.

source: If you save the results of Compare, Export, Find, Import, Merge, Synchronize and Validate operations to disk, they are stored in the same directory as the database.
ru_ru: Сохранённые отчёты об операциях сравнения, экспорта, импорта, поиска, слияния и синхронизации создаются в том же каталоге, где находится контейнер.

source: If you select this checkbox, then recent passwords will be saved with this entry.
ru_ru: Если флажок установлен, для данного элемента будут сохраняться предыдущие пароли.

source: If you select this menu item, only entries that were found during the last Find operation will be shown.
ru_ru: Если выбран этот пункт меню, в списке отображаются только те элементы, которые были отобраны при последней операции поиска.

source: If you select this menu item, only entries with a defined expiry date will be shown in the list.
ru_ru: Если выбран этот пункт меню, в списке отображаются только те элементы, у которых задана дата истечения пароля.

source: If you select this menu item, only entries with an expiry date will be shown in the list.
ru_ru: Если выбран этот пункт меню, в списке отображаются только те элементы, у которых задана дата истечения пароля.

source: If you use several databases, drop-down list.
ru_ru: Если вы используете несколько контейнеров, можно выбрать другой контейнер из выпадающего списка.

source: If you use several databases, you can choose between them using the drop-down list.
ru_ru: Если вы используете несколько контейнеров, можно выбрать другой контейнер из выпадающего списка.

source: If you use these variables, the expanded path will be shown underneath once you navigate to a different control on this tab.
ru_ru: Раскрытый путь к каталогу будет указан под полем ввода при переключении на другое поле или вкладку.

source: If you wish to protect your database using both your YubiKey and a Safe Combination ("two factor authentication"), then first enter the Safe Combination in the "Safe Combination" and "Verify" fields, then click on the Yubikey button.
ru_ru: Если для защиты контейнера вы желаете одновременно использовать YubiKey и мастер-пароль, («двуxфакторная аутентификация»), тогда сначала введите пароль в поля «Пароль» и «Подтверждение», а затем щёлкните на кнопке с надписью YubiKey.

source: If you wish to reset these values to the default for search, press the Reset button.
ru_ru: Для возврата ограничений поиска на условия по умолчанию нажмите кнопку «Сбросить».

source: If you wish to reset these values to the default for the function, press the Reset button.
ru_ru: Для возврата ограничений на условия по умолчанию нажмите кнопку «Сбросить».

source: If you wish to share a common configuration file between users and/or across different PCs, you can either keep the file in the executable directory, or specify its location explicitly using the '-g config-file' option, as described in command line arguments.
ru_ru: Если Вы желаете использовать общий файл настроек для нескольких пользователей/компьютеров, оставьте его в том же каталоге, где находится исполняемый файл, или укажите путь к нему при запуске (через ключ «-g файл_настроек», описанный в справке по параметрам командной строки).

source: If you wish, enter (and confirm) a password in the New Safe Combination and Confirmation fields.
ru_ru: Если требуется, введите (и подтвердите) новый пароль в поля «Новый пароль» и «Подтверждение».

source: If you're unhappy with the result, you can click on Generate again, or edit the password manually.
ru_ru: Если созданный пароль вам не подходит, нажмите кнопку ещё раз или измените пароль вручную.

source: If you're using YubiKey authentication, click on the Yubikey button, then activate your YubiKey.
ru_ru: Если вы используете YubiKey, нажмите кнопку с надписью «YubiKey» и коснитесь кнопки на устройстве YubiKey.

source: If you're using a "single sign-on" system that allows you to share the same password across different machines/servers/applications, etc. you can setup Password Safe entries accordingly, so that changing one password affects all other related entries.
ru_ru: Если вы используете системы «единого входа», которые позволяют использовать один и тот же пароль для различных машин/серверов/приложений, то можно настроить несколько элементов Password Safe таким образом, чтобы изменение пароля в одном из них автоматически отражалось в остальных.

source: If you've chosen to protect your database using both your YubiKey and a Safe Combination, first enter the Safe Combination in the "Open Password Safe" field, then click on the Yubikey button.
ru_ru: Если для защиты контейнера используются YubiKey и мастер-пароль, тогда сначала введите пароль в поле «Пароль», а затем щёлкните на кнопке с надписью YubiKey.

source: If you've chosen to protect your database using your YubiKey only, then leave the "Open Password Safe" field empty, and click on the Yubikey button.
ru_ru: Если для защиты вы желаете использовать только YubiKey, тогда оставьте поле «Пароль» пустым, и щёлкните на кнопке с надписью YubiKey.

source: If your YubiKey is connected to your PC, then a "Yubikey" button and text area will appear in the Safe Combination Entry and Setup windows, as show above.
ru_ru: Если YubiKey подключён к ПК, будут видны кнопка «YubiKey» и текстовое поле с описанием (см. картинку выше).

source: If, however, the PWS_PREFSDIR environment variable is set, pwsafe will use the configuration file stored there.
ru_ru: Но, если задана переменная окружения PWS_PREFSDIR, Password Safe будет использовать файл настроек, указанный в ней.

source: If, however, you find that you have several filters that you wish to use repeatedly, then you can store them and manage them effectively via the "View → Filter → Manage..." dialog box
ru_ru: Если же у вас есть фильтры, которые хотелось бы использовать повторно, их можно сохранить воспользовавшись пунктом меню Просмотр→Фильтры→Управление.

source: If, however, you find that you have several filters that you wish to use repeatedly, then you can store them and manage them effectively via the "View → Filter → Manage..." dialog box.
ru_ru: Если же у вас есть фильтры, которые хотелось бы использовать повторно, их можно сохранить воспользовавшись пунктом меню Вид→Фильтры пользователя→Управление.

source: If, however, you find that you have several filters that you wish to use repeatedly, then you can store them and manage them effectively via the View->Filter-> Manage... dialog box
ru_ru: Если же у вас есть фильтры, которые хотелось бы использовать повторно, их можно сохранить воспользовавшись пунктом меню «Просмотр»→«Фильтры»→«Управление».

source: If, on the other hand, there are none left after migration, the empty file will be deleted.
ru_ru: Если же после переноса настроек файл окажется пустым, он будет удалён.

source: Ignored
ru_ru: Игнорируются

source: Import
ru_ru: Импорт

source: Import From
ru_ru: Импортировать из

source: Import KeePass Entries
ru_ru: Импорт из KeePass

source: Import Password Entries
ru_ru: Импорт элементов

source: Import Text Settings
ru_ru: Настройки импорта из простого текста

source: Import Text Settings Dialog
ru_ru: Настройки импорта из простого текста

source: Import data to a text file.
ru_ru: Импортировать данные из текстового файла

source: Import data to an XML file.
ru_ru: Импортировать данные из XML-файла

source: Import the contents of a previously exported or correctly formatted text file, XML, or a KeePass V1 password database into the current database.
ru_ru: Импортировать в текущий контейнер содержимое ранее экспортированного или правильно составленного текстового файла, XML-файла или контейнера KeePass V1.

source: Import the contents of a previously exported or correctly formatted text file, XML, or a KeePass password database into the current database.
ru_ru: Импортировать в текущий контейнер содержимое ранее экспортированного или правильно составленного текстового файла, XML-файла или контейнера KeePass.

source: Imported text is assumed to have:
ru_ru: При импорте считается, что:

source: Importing Entries
ru_ru: Импорт элементов

source: In Password Safe entries, only the Title and Password fields are mandatory.
ru_ru: В элементах контейнера Password Safe, только поля «заголовок» и «пароль» являются обязательными для заполнения.

source: In Password Safe entries, only the Title field is mandatory.
ru_ru: В элементах контейнера Password Safe, только поле «заголовок» является обязательным для заполнения.

source: In Password Safe, an entry can refer to another's password by means of a specially formatted password in the referring entry.
ru_ru: Если в Password Safe пароль элемента записать определённым образом, он будет ссылался на пароль другого элемента.

source: In Windows Vista and later, the pwsafe.cfg file can be found in: "C:\Users\<username>\AppData\Local\PasswordSafe" but, in Windows XP, it can be found in: "C:\Documents and Settings\<username>\Application Data\PasswordSafe".
ru_ru: В Windows Vista и последующих версиях файл «pwsafe.cfg» находится в каталоге C:\Users\<имя_пользователя>\AppData\Local\PasswordSafe, а в Windows XP — в каталоге C:\Documents and Settings\<имя_пользователя>\Application Data\PasswordSafe.

source: In Windows Vista or Windows 7, the pwsafe.cfg file can be found in the following directory: "C:\Users\<username>\AppData\Local\PasswordSafe" and in Windows XP, it can be found in: "C:\Documents and Settings\<username>\Application Data\PasswordSafe".
ru_ru: В Windows Vista и Windows 7 файл «pwsafe.cfg» находится в каталоге «C:\Users\<имя_пользователя>\AppData\Local\PasswordSafe», а в Windows XP — в каталоге «C:\Documents and Settings\<имя_пользователя>\Application Data\PasswordSafe».

source: In Windows Vista or Windows 7, the pwsafe.cfg file can be found in: "C:\Users\<username>\AppData\Local\PasswordSafe" and in Windows XP, it can be found in: "C:\Documents and Settings\<username>\Application Data\PasswordSafe".
ru_ru: В Windows Vista и Windows 7 файл «pwsafe.cfg» находится в каталоге C:\Users\<имя_пользователя>\AppData\Local\PasswordSafe, а в Windows XP — в каталоге C:\Documents and Settings\<имя_пользователя>\Application Data\PasswordSafe.

source: In addition to the backup and restore described here, Password Safe automatically keeps a copy of the database before you save a change.
ru_ru: Резервные копии создаются не только вручную, но и автоматически перед сохранением изменений в контейнере.

source: In addition to the normal checks on the consistency of the information you enter, you must also provide a unique name (within this database) for this policy.
ru_ru: К параметрам применяются те же правила согласования, что и для политики по умолчанию. Кроме того вам нужно задать имя политики (оно должно быть уникально в текущем контейнере).

source: In addition to the normal checks on the consistency of the information you enter, you must also provide provide a unique name (within this database) for this policy.
ru_ru: К параметрам применяются те же правила согласования, что и для политики по умолчанию. Кроме того вам нужно задать имя политики (оно должно быть уникально в текущем контейнере).

source: In addition, Password Safe is able to pass arguments to the command such as the entry's username, password, etc., as described below.
ru_ru: Также, Password Safe может передать в параметры команды имя пользователя, пароль и некоторые другие данные, описанные ниже.

source: In addition, a Normal entry can have an expiry date placed on its password.
ru_ru: Кроме того, у обычных элементов может быть задана дата истечения пароля.

source: In addition, each entry can have its own symbol list specified via the Add or Edit entry dialogs.
ru_ru: Кроме того, каждый элемент может иметь свой набор символов для пароля, задаваемый в диалоге добавления/редактирования элемента.

source: In addition, multiple entries may be selected in the comparision database (left-click in the second column with the Ctrl key pressed for the second and subsequent entries).
ru_ru: Кроме того, вы можете выделить несколько элементов из сравниваемого контейнера. Для пометки элемента щёлкните левой кнопкой мыши во втором столбце (для пометки второго и последующих элементов удерживайте Ctrl).

source: In addition, multiple entries may be selected in the comparison database (left-click in the second column with the Ctrl key pressed for the second and subsequent entries).
ru_ru: Кроме того, вы можете выделить несколько элементов из сравниваемого контейнера. Для пометки элемента щёлкните левой кнопкой мыши во втором столбце (для пометки второго и последующих элементов удерживайте Ctrl).

source: In addition, some external editors will use an existing instance to edit the temporary text file and this will cause Password Safe to immediately return leaving the data unchanged even though the temporary text file is still available in the external editor.
ru_ru: Кроме того, некоторые редакторы могут использовать ранее запущенный экземпляр программы для редактирования этого файла, в этом случае Password Safe получит управление не дожидаясь изменения в файле, а временный файл останется доступным для редактора.

source: In addition, the System Tray tooltip shows the ID before the database name.
ru_ru: Кроме того, назначенный идентификатор отображается перед именем контейнера во всплывающей подсказке значка.

source: In addition, the displayed entries are shown in red.
ru_ru: При этом, элементы, попавшие под условия фильтра, выделяются красным цветом.

source: In addition, the following fields may be set in this tab:
ru_ru: Также можно заполнить следующие поля:

source: In addition, the following modifiers are available to combine with the above special control codes.
ru_ru: Кроме того, для этих последовательностей можно указывать дополнительные модификаторы.

source: In addition, the following modifiers can be combined with the above special control codes.
ru_ru: Кроме того, для этих последовательностей можно указывать дополнительные модификаторы.

source: In addition, the following options are accepted and may be useful if you wish to share the same preferences across several machines, for example, when running Password Safe from a disk-on-key.
ru_ru: Данные параметры могут оказаться полезными, если вы желаете использовать одни и те же настройки на разных машинах, например, при запуске Password Safe со съёмного диска.

source: In addition, the following options are accepted:
ru_ru: Также допустимы следующие параметры:

source: In addition, to 'export' a subset of entries to another Password Safe database, just start Password Safe (assuming you permit multiple instances via "Manage ? Options ? System" tab) and create a new database, whilst having your normal database open in another instance.
ru_ru: Чтобы экспортировать элементы в другой контейнер Password Safe, запустите ещё одну копию Password Safe (должен быть разрешён запуск нескольких экземпляров на вкладке Управление→Настройки→Система) и создайте новый контейнер.

source: In addition, to 'export' a subset of entries to another Password Safe database, just start Password Safe (assuming you permit multiple instances via "Manage → Options → System" tab) and create a new database, whilst having your normal database open in another instance.
ru_ru: Чтобы экспортировать элементы в другой контейнер Password Safe, запустите ещё одну копию Password Safe (должен быть разрешён запуск нескольких экземпляров на вкладке Сервис→Настройки→Система) и создайте новый контейнер.

source: In addition, to 'export' a subset of entries to another Password Safe database, just start Password Safe (assuming you permit multiple instances via Manage->Options->System tab) and create a new database, whilst having your normal database open in another instance.
ru_ru: Чтобы экспортировать элементы в другой контейнер Password Safe, запустите ещё одну копию Password Safe (должен быть разрешён запуск нескольких экземпляров на вкладке «Управление→Настройки→Система») и создайте новый контейнер.

source: In addition, to 'import' a subset of entries from another Password Safe database, just start Password Safe (assuming you permit multiple instances via Manage->Options->System tab) and open the other database, whilst having your normal database open in another instance.
ru_ru: Чтобы импортировать элементы из другого контейнера Password Safe, запустите ещё одну копию Password Safe (должен быть разрешён запуск нескольких экземпляров на вкладке «Управление→Настройки→Система») и откройте нужный контейнер.

source: In addition, you can invoke AutoType after running an arbitrary command specified in the entry's Run Cmd field.
ru_ru: Также существует возможность вызова автонабора после запуска произвольных команд из поля Выполнить.

source: In addtion, when right clicking on an alias or shortcut base entry, there is an extra submenu ("Go to Aliases..." and "Go to Shortcuts...") to allow easy access to their respective dependants, i.e. aliases or shortcuts.
ru_ru: В контекстном меню исходных элементов для псевдонимов и ярлыков есть дополнительное подменю для быстрого доступа к подчинённым элементам («Перейти к псевдониму...» и «Перейти к ярлыку...» соответственно).

source: In all cases, to read a database generated by a previous version of Password Safe, just open it as you would any database.
ru_ru: Открытие контейнера, созданного с помощью предыдущих версий Password Safe, происходит таким же образом, как открытие контейнера для текущей версии.

source: In all cases, you have the option to select the "Advanced field selection criteria", which will show an extra Advanced page allowing you to restrict what these functions do based on the contents of the Group, Title, User Name, URL or Notes fields and/or which fields to Compare, Merge, Synchronize or Export.
ru_ru: Во всех случаях можно поставить флажок «Расширенные условия отбора». После этого будет доступна ещё одна страница, на которой можно указать ограничения по группе, заголовку, имени пользователя, ссылке или заметкам, а также отобрать поля для сравнения, слияния или экспорта.

source: In any case, you can also change this per-entry, as described here.
ru_ru: Описание того, как настроить задержку ввода для конкретного элемента, приведено в разделе Автонабор.

source: In general, 'variables' are replaced with values associated with them before being passed to the computer for execution.
ru_ru: «Переменные» заменяются соответствующими значениями перед выполнением команды.

source: In general, a master password (like any password) should consist of mixed case characters with at least one number or special character (such as those found above the number keys on a keyboard).
ru_ru: Мастер-пароль (как и любой другой) должен состоять из букв разного регистра, содержать хотя бы одну цифру или специальный символ (например, один из тех, что расположены над цифрами на клавиатуре).

source: In general, it is a good idea to use the longest allowable length and the largest permitted mix of characters.
ru_ru: В общем случае лучше всего использовать пароли максимально допустимой длины, состоящие из смеси символов различных наборов.

source: In more detail: The configuration file is designed to support multiple users from multiple machines.
ru_ru: Файл с настройками поддерживает хранение настроек нескольких пользователей, возможно, работающих с разных машин.

source: In order to support new features and enhance security, the database format which is used to store entries and preferences has been changed between major versions.
ru_ru: При изменении старшей цифры в версии программы изменяется формат контейнера. Это делается для того, чтобы повысить безопасность и/или реализовать работу новых функции.

source: In particular, via the Backups tab in the Options dialog box, you may specify how many backups to keep (we recommend a minimum of 3 to 5) and whether to use an incremental number or date/time value in the backup file name.
ru_ru: В частности, на вкладке «Резервные копии» диалога «Сервис→Настройки» можно указать необходимое количество хранимых резервных копий (мы рекомендуем оставлять от 3 до 5 копий) и способ именования (по счётчику или дате/времени).

source: In rare circumstances, where Password Safe is unable to create or write to the configuration file, the registry will be used.
ru_ru: Реестр будет использован лишь в тех редких случаях, когда Password Safe не сможет создать или произвести запись в файл с настройками.
